[
  {
    "title": "Software Engineer",
    "company": "Lean Techniques",
    "dateStart": "May 2020",
    "dateEnd": "",
    "location": "Des Moines, Iowa Area",
    "description": "Work as a software engineering consultant to clients",
    "stack": "",
    "items": []
  },
  {
    "title": "Software Engineer",
    "subposition": true,
    "company": "Hy-Vee",
    "dateStart": "May 2020",
    "dateEnd": "",
    "location": "Des Moines, Iowa Area",
    "description": "Work supporting and modernizing legacy backend systems around business to business invoicing",
    "stack": "C#, Kotlin, Spring Boot, MSSQL, GCP, Javascript",
    "items": [
      "Supported and modernized legacy backend applications",
      "Improved team's productivity through coaching good development/delivery practices",
      "Designed and facilitated learning sessions around topics like testing and TDD",
      "Created and helped maintained team onboarding documentation/process"
    ]
  },
  {
    "title": "Software Engineer",
    "company": "Source Allies, Inc.",
    "dateStart": "Nov 2015",
    "dateEnd": "Mar 2020",
    "location": "Des Moines, Iowa Area",
    "description": "Worked as a consultant to clients as well as worked on internal projects.",
    "stack": "PHP",
    "items": [
      "Conducted peer interviews for potential engineers",
      "Presented talks and workshops on-site and conferences",
      "Coached and paired with other teams and individuals on testing practices",
      "Founded a QA/testing community of practice",
      "Implemented tool to migrate all company repositories from Bamboo to Github",
      "Implemented tool to scrap a client's legacy website for text & images and upload to their new site"
    ]
  },
  {
    "title": "Test Lead",
    "subposition": true,
    "company": "Corteva Agriscience",
    "dateStart": "Nov 2019",
    "dateEnd": "Mar 2020",
    "location": "Des Moines, Iowa Area",
    "description": "Oversaw quality and testing practices on a feature team. Helped deliver the feature from concept to the first beta users.",
    "stack": "AWS, Angular, Protractor, Typescript, Runscope, Azure DevOps, Python, Locust, MSSQL",
    "items": [
      "Wrote test cases for features implemented by team",
      "Tested features implemented by team",
      "Worked with product owner to accept features",
      "Implemented contract testing for a third party API required for team's primary feature",
      "Reworked existing end to end test suite to improve stability, code consistency",
      "Implemented parameterization on end to end test suite to reuse existing tests for team's feature testing",
      "Provided cross team quality/testing coaching and support"
    ]
  },
  {
    "title": "Senior Software Engineer",
    "subposition": true,
    "company": "John Deere",
    "dateStart": "Sep 2017",
    "dateEnd": "Oct 2019",
    "location": "Des Moines, Iowa Area",
    "description": "An R&D cross functional feature team delivering ag data applications and services. The team was heavily focused on TDD and pair programming.",
    "stack": "AWS, Java, Spring Boot, jUnit, React, Jest, Typescript, Scala, Python, Ruby, Groovy, Jenkins, Swagger, Gatling, Prometheus, webdriver.io",
    "items": [
      "Worked on several projects directly involved with initial conversations with business, requirements gathering, acceptance criteria, technical spikes and assessments, implementation, deployment, integration with other systems, security, documentation, releasing to beta, fixing initial bugs, releasing to production and providing 24 on call support, updating and maintaining application",
      "Maintained a large family of 26 inherited legacy applications/services each deploy in 4 environments with varying stacks",
      "Served as the team's frontend lead helping guide implementation choices as well as providing help with html, css, javascript, React",
      "Developed several applications both backend (Java, Spring Boot, Scala) and frontend (React)",
      "Worked on several company community owned libraries to delivery our features",
      "Deployed and maintained infrastructure as code in AWS using CloudFormation templates",
      "Created and maintained swagger documents for APIs",
      "Created and implemented data backup plans and strategies",
      "Implemented features from other teams' backlogs to unblock our delivery",
      "Worked on several company and team hack-a-thon projects",
      "Served as the team's test lead developing testing practices, providing insight to risk mitigation, testing concerns to the team and business, quality and testing (including unit testing) coaching to the team through pairing and katas, and championing testing be included with development and devops as tasks not roles",
      "Cross team quality and testing coaching",
      "Developed several testing tools for the team",
      "Implemented load and stress tests for APIs using Gatling",
      "Implemented end to end tests using webdriver.io",
      "Implemented end to end fitness tests for team developed features in company's monolith service"
    ]
  },
  {
    "title": "Software Engineer",
    "subposition": true,
    "company": "Pioneer",
    "dateStart": "May 2016",
    "dateEnd": "Sep 2016",
    "location": "Des Moines, Iowa Area",
    "description": "Responsible for implementing system acceptance testing using Protractor across multiple applications.",
    "stack": "Protractor, Typescript, MSSQL, Jenkins",
    "items": [
      "Cleared lengthy backlog of test automation",
      "Standardized all protractor test suites and page object implementations",
      "Standardized how test data was defined and used",
      "Integrated protractor tests in to continuous integration/deployment pipeline",
      "Implemented load and stress testing of the API using JMeter",
      "Implemented script for generating JMeter test plans from telemetry data"
    ]
  },
  {
    "title": "Software Engineer",
    "subposition": true,
    "company": "Pioneer",
    "dateStart": "Dec 2015",
    "dateEnd": "Apr 2016",
    "location": "Des Moines, Iowa Area",
    "description": "A pilot feature team to delivery a mobile application for uploading ag data.",
    "stack": "C#, Xamarin, iOS, MSSQL, Jenkins, Angular",
    "items": [
      "Developed features for mobile application",
      "Implemented a CICD pipeline to deploy builds to the Apple Store via TestFlight",
      "Implemented system acceptance testing for a cross platform mobile application developed with Xamarin",
      "Implemented a web app in Angular for visualizing spatiotemporal ag data onto a map"
    ]
  },
  {
    "title": "Quality Engineer",
    "company": "Athene USA",
    "dateStart": "Sep 2016",
    "dateEnd": "Sep 2017",
    "location": "Des Moines, Iowa Area",
    "description": "An evergreen Test Automation team. Lead those efforts through a subcommittee to develop technology stack, processes, documentation & best practices.",
    "stack": "Python, Webdriver, Oracle DB, Jenkins",
    "items": [
      "Acted as the business channel's test lead",
      "Managed a small team of four remote testers",
      "Delivered all test automation for business channel",
      "Collaborated with product owner, test lead & developers to create test strategy for business channel and test plans for products",
      "Participated in a subcommittee for the stack, processes, documentation and best practices for test automation",
      "Deployed a jenkins instance and CICD pipelines for test automation suites",
      "Implemented a greenfield test framework and runner in Python for selenium/webdriver tests to meet business's specific requirements",
      "Implemented library for parsing and validating DTCC data files (POV, COM, FAR)",
      "Implemented library for parsing PDF files and validating them against a template PDF file",
      "Implemented roles based security end to end test suite",
      "Created automation suite to input data in to Trilogy DCM using declarative data files",
      "Rotated scrum master role among business channel test leads"
    ]
  },
  {
    "title": "Quality Engineer",
    "company": "Zenti, Inc.",
    "dateStart": "June 2013",
    "dateEnd": "Oct 2015",
    "location": "Palo Alto, CA Area",
    "description": "A 100% remote startup. Responsible for designing, implementing and maintaining system acceptance testing across multiple applications/environments.",
    "stack": "AWS, Ruby, Ruby On Rails, jQuery, Webdriver, RSpec, Jenkins, Postgres, Redis",
    "items": [
      "Automated a large portion of the manual regression test suite. This allowed the other QA to focus on exploratory testing and I could pick up development stories",
      "Created a frontend application for text scraping web sites using a rule system based on url pattern matching",
      "Created a frontend application to filter a high throughput data stream using naive bayesian classification and set logic",
      "Created a frontend application for end users to train text classification categories using Amazon's Mechanical Turk service",
      "Created and trained several text classification categories",
      "Implemented continuous integration deployment pipeline in Jenkins",
      "Implemented end to end and integration testing of internal/external APIs",
      "Implemented stress testing of applications and APIs using JMeter",
      "Implemented unit tests for existing untested code",
      "Implemented a k-fold cross validation tool for testing our data sets"
    ]
  }
]
