[
  {
    "title": "Software Engineer",
    "company": "Source Allies, Inc.",
    "dateStart": "Nov 2015",
    "dateEnd": "Mar 2020",
    "location": "Des Moines, Iowa Area",
    "description": "Worked as a consultant to clients as well as worked on internal projects.",
    "items": [
      "Conducted peer interviews for potential engineers",
      "Presented talks and workshops on-site and conferences",
      "Coaching and pairing with feature teams on testing practices",
      "Coached individuals on testing practices",
      "Founded a QA/testing community of practice"
    ]
  },
  {
    "title": "Test Lead",
    "subposition": true,
    "company": "Corteva Agriscience",
    "dateStart": "Nov 2019",
    "dateEnd": "Mar 2020",
    "location": "Des Moines, Iowa Area",
    "description": "Oversaw quality and testing practices on a feature team. Helped deliver the feature from concept to the first beta users.",
    "stack": "AWS, Angular, Protractor, Typescript, Runscope, Azure DevOps, Python, Locust, MSSQL",
    "items": [
      "Wrote test cases for features implemented by team",
      "Tested features implemented by team",
      "Worked with product owner to accept features",
      "Implemented contract testing for a third party API required for team's primary feature",
      "Provided cross team quality/testing coaching and support"
    ]
  },
  {
    "title": "Senior Software Engineer",
    "subposition": true,
    "company": "John Deere",
    "dateStart": "Sep 2017",
    "dateEnd": "Oct 2019",
    "location": "Des Moines, Iowa Area",
    "description": "A R&D feature team focused on delivering ag data applications.",
    "stack": "AWS, Java, Spring Boot, jUnit, React, Jest, Typescript, Scala, Python, Ruby, Groovy, Jenkins, Swagger, Gatling, Prometheus",
    "items": [
      "Developed and tested applications",
      "Deployed and maintained AWS infrastructure through CloudFormation",
      "Helped drive team towards full cross functionality where development, testing, ops are tasks not roles",
      "Acted as the team's test lead",
      "Provided insight to risk mitigation, testing concerns",
      "Provided quality and testing coaching to the team through pairing and katas",
      "Cross team quality and testing coaching",
      "Provided coaching around javascript, node, React and general web technologies",
      "Developed testing tools and processes for the team",
      "Created and maintained swagger documents for feature APIs",
      "Participated in on-call rotation in after-hours support of all team's systems",
      "Developed tool for testing CloudWatch alarms and their integration with xMatters",
      "Implemented other teams features or backlog to unblock delivery"
    ]
  },
  {
    "title": "Software Engineer",
    "subposition": true,
    "company": "Pioneer",
    "dateStart": "May 2016",
    "dateEnd": "Sep 2016",
    "location": "Des Moines, Iowa Area",
    "description": "Responsible for implementing system acceptance testing using Protractor across multiple applications.",
    "stack": "Protractor, Typescript, MSSQL, Jenkins",
    "items": [
      "Cleared lengthy backlog of test automation",
      "Standardized all protractor test suites and page object implementations",
      "Standardized how test data was defined and used",
      "Integrated protractor tests in to continuous integration/deployment pipeline",
      "Implemented load and stress testing of the API using JMeter",
      "Implemented script for generating JMeter test plans from telemetry data"
    ]
  },
  {
    "title": "Software Engineer",
    "subposition": true,
    "company": "Pioneer",
    "dateStart": "Dec 2015",
    "dateEnd": "Apr 2016",
    "location": "Des Moines, Iowa Area",
    "description": "A pilot feature team to delivery a mobile application for uploading ag data.",
    "stack": "C#, Xamarin, iOS, MSSQL, Jenkins",
    "items": [
      "Implemented system acceptance testing for a cross platform mobile application developed with Xamarin",
      "Created web app for visualizing spatiotemporal ag data onto a map"
    ]
  },
  {
    "title": "Quality Engineer",
    "company": "Athene USA",
    "dateStart": "Sep 2016",
    "dateEnd": "Sep 2017",
    "location": "Des Moines, Iowa Area",
    "description": "Built out an evergreen QA automation team/practice. Lead those efforts through a subcommittee developing our technology stack, processes, documentation & best practices. Was also the lead QA engineer for my business channel as well as rotating scrum master for channels.",
    "stack": "Python, Webdriver, Oracle DB",
    "items": [
      "Collaborated with product owner, test lead & developers to create test strategy for business channel and test plans for products",
      "Delivered all test automation for business channel",
      "Managed a small team of remote testers",
      "Implemented library for parsing and validating DTCC data files (POV, COM, FAR)",
      "Implemented library for validating PDF files against a template PDF file",
      "Implemented roles based security end to end test suite",
      "Created automation suite to input data in to Trilogy DCM using declarative data files"
    ]
  },
  {
    "title": "Quality Engineer",
    "company": "Zenti, Inc.",
    "dateStart": "June 2013",
    "dateEnd": "Oct 2015",
    "location": "Palo Alto, CA Area",
    "description": "Responsible for designing, implementing and maintaining system acceptance testing across multiple applications/environments.",
    "stack": "AWS, Ruby, Ruby On Rails, Webdriver, RSpec, Jenkins, Postgres, Redis",
    "items": [
      "Moved company from manual QA processes to automated giving us better test coverage, faster deploys and more time for QAs to perform exploratory testing",
      "Implemented system acceptance testing using Selenium",
      "Implemented continuous integration deployment pipeline in Jenkins",
      "Implemented end to end and integration testing of internal/external APIs",
      "Implemented stress testing of applications and APIs using JMeter",
      "Implemented unit tests for existing untested code",
      "Implemented cross validation of the classification engine using a k-fold cross validation",
      "Created application for text scraping web sites using a rule system based on url pattern matching",
      "Created application to filter a high throughput data stream using naive bayesian classification and set logic"
    ]
  }
]
